%%%% 求解3次准均匀B样条基函数 N(i,3)
n=120;  %控制点个数
a=1:n+1;
u = zeros(1,n+8);
u =[1 1 1 1 [2:n+2] n+2 n+2 n+2] ;  % 参数区间范围
% u(5:n+5)=a;u(n+6:n+8)=[n+1,n+1,n+1];% 分段区间点

syms t
N = t*ones(1,n+3);  %存储基函数
%j=n+2;
j =  23  
uu = (1-t)*u(j+1) + t*u(j+1+1); %区间[u(i),u(i+1)]的变量uu,t in [0,1]

for i = 0:n+3
    i
    one = ((uu - u(i+1))/(u(i+1+2) - u(i+1))) * ((uu-u(i+1))/(u(i+1+1) - u(i+1)));  %[u(i+1),u(i+1+1)]
    two = ((uu - u(i+1))/(u(i+1+2) - u(i+1))) * ((u(i+1+2) -uu)/(u(i+1+2) - u(i+1+1))) +...
        ((u(i+1+3) - uu)/(u(i+1+3) - u(i+1+1)))*((uu-u(i+1+1))/(u(i+1+2) - u(i+1+1))); %[u(i+1+1),u(i+!+2)]
    three = ((u(i+1+3) - uu)/(u(i+1+3) - u(i+1+1))) * ((u(i+1+3) - uu)/(u(i+1+3) - u(i+1+2))); %[u(i+1+2),u(i+1+3)]
    
    four = ((uu - u(i+1+1))/(u(i+1+2+1) - u(i+1+1))) * ((uu-u(i+1+1))/(u(i+1+1+1) - u(i+1+1)));
    five = ((uu - u(i+1+1))/(u(i+1+2+1) - u(i+1+1))) * ((u(i+1+2+1) -uu)/(u(i+1+2+1) - u(i+1+1+1))) +...
       ( (u(i+1+3+1) - uu)/(u(i+1+3+1) - u(i+1+1+1)))*((uu-u(i+1+1+1))/(u(i+1+2+1) - u(i+1+1+1)));
   six = ((u(i+1+3+1) - uu)/(u(i+1+3+1) - u(i+1+1+1))) * ((u(i+1+3+1) - uu)/(u(i+1+3+1) - u(i+1+2+1)));
   
   co1 = (uu-u(i+1))/(u(i+1+3)-u(i+1)); %系数1
   co2 = (u(i+1+4) - uu)/(u(i+1+4) - u(i+1+1)); %系数2
  
   if u(j+1) == u(i+1) && u(j+1+1)==u(i+1+1)
       1
       N(i+1) = co1 *one
   elseif u(j+1) == u(i+1+1) && u(j+1+1) == u(i+1+2)
       2
       N(i+1) = co1 * two + co2 * four
   elseif u(j+1) == u(i+1+2) && u(j+1+1) == u(i+1+3)
       3
       N(i+1) = co1 * three + co2 * five
   elseif u(j+1) == u(i+1+3) && u(j+1+1) == u(i+1+4)
       4
       N(i+1) = co2 * six
   else N(i+1) = 0;
   end
   
%  N(i) = (uu>=u(i+1) & uu<u(i+1+1)).* co1 * one ...
%     + (uu>=u(i+1+1) & uu<u(i+1+2)).* (co1 * two + co2 * four) ...
%     + (uu>=u(i+1+2) & uu<u(i+1+3)).* (co1 * three + co2 * five)...
%     + (uu>=u(i+1+3) & uu<u(i+1+4)).* co2 *six ...
%     + (uu>=u(i+1+4) | u<u(i+1)) .* 0;
end





